{
  "welcomeTitle": "Professor S. Govindasamy",
  "welcomeSubtitle": "Distinguished Academic Legacy",
  "heroDescription": "Celebrating the remarkable journey of a professor who mentored 50+ PhD students, transforming lives from village to global success.",
  "professorName": "Professor S. Govindasamy",
  "professorTitle": "Professor Emeritus",
  "phdStudents": "PhD Students",
  "phdStudentsDesc": "Mentored and guided to success",
  "usaSuccess": "USA Success",
  "usaSuccessDesc": "Students now successful in USA",
  "yearsTeaching": "Years Teaching",
  "yearsTeachingDesc": "Dedicated to academic excellence",
  "awards": "Awards",
  "awardsDesc": "Recognition for outstanding contribution",
  "impactNumbers": "Impact in Numbers",
  "impactDescription": "A lifetime of dedication to academic excellence and student success",
  "exploreJourney": "Explore the Journey",
  "exploreDescription": "Discover the inspiring story of academic excellence and student transformation",
  "aboutTitle": "About Professor S. Govindasamy",
  "aboutDescription1": "Professor S. Govindasamy's journey from a small village to becoming a distinguished academic mentor is truly inspiring. His dedication to education and student development has transformed the lives of over 50 PhD students.",
  "aboutDescription2": "With over four decades of teaching experience, Professor Govindasamy has been instrumental in shaping the careers of numerous students, many of whom have achieved remarkable success in the United States and around the world.",
  "aboutDescription3": "His commitment to academic excellence, combined with his nurturing approach to mentorship, has made him a beloved figure in the academic community and a source of inspiration for generations of students.",
  "timelineTitle": "Academic Timeline",
  "timelineDescription": "Journey through the key milestones of Professor S. Govindasamy's remarkable academic career",
  "studentsTitle": "Student Directory",
  "studentsDescription": "Meet the 50+ PhD alumni who have achieved success under Professor S. Govindasamy's guidance",
  "galleryTitle": "Photo Gallery",
  "galleryDescription": "Visual journey through decades of academic excellence and student achievements",
  "achievementsTitle": "Achievements & Publications",
  "achievementsDescription": "Recognition, awards, and scholarly contributions throughout the academic career",
  "accountabilityTitle": "Financial Accountability",
  "accountabilityDescription": "Transparent reporting of funding sources and expenditure details",
  "contactTitle": "Contact & Legacy",
  "contactDescription": "Get in touch and learn about the continuing impact of Professor S. Govindasamy's work"
}
