{
  "welcomeTitle": "Professor S. Govindasamy",
  "welcomeSubtitle": "Educational Philanthropist",
  "heroDescription": "Celebrating the remarkable journey of an educator who dedicated his life to helping people from all walks of life through education, community service, and philanthropic endeavors.",
  "professorName": "Professor S. Govindasamy",
  "professorTitle": "Professor Emeritus",
  "phdStudents": "PhD Students",
  "phdStudentsDesc": "Mentored and guided to success",
  "usaSuccess": "USA Success",
  "usaSuccessDesc": "Students now successful in USA",
  "yearsTeaching": "Years Teaching",
  "yearsTeachingDesc": "Dedicated to academic excellence",
  "awards": "Awards",
  "awardsDesc": "Recognition for outstanding contribution",
  "impactNumbers": "Impact in Numbers",
  "impactDescription": "A lifetime of dedication to academic excellence and student success",
  "exploreJourney": "Explore the Journey",
  "exploreDescription": "Discover the inspiring story of academic excellence and student transformation",
  "aboutTitle": "About Professor S. Govindasamy",
  "aboutDescription1": "In the heart of Tamil Nadu's Kaveri delta, where rice paddies stretch endlessly under monsoon skies, a remarkable academic odyssey began in 1945.\n\nThe son of farmers Saminathan Vellalar and Muthukkannu Achi, young Govindasamy would transform from a village boy walking barefoot to school into 'SG' - a name that would resonate through the corridors of India's most prestigious institutions.\n\nHis birthplace, Vendakkottai near Pattukkottai in Thanjavur district, was a world away from the research laboratories he would one day command. Yet it was precisely this rural foundation that would shape his revolutionary approach to education and mentorship.\n\nIn post-independence India's landscape of emerging opportunities, SG represented a new breed of scholar - one who would bridge the gap between traditional wisdom and modern scientific inquiry. His parents, though simple farmers, possessed the foresight to nurture their son's intellectual curiosity, setting in motion a journey that would culminate in him becoming the pioneering doctorate holder of his entire community.",
  "aboutDescription2": "What followed was an extraordinary testament to human determination against overwhelming odds.\n\nPicture a young scholar traversing seven kilometers of rural terrain daily, his feet tracing paths through dust and mud to reach Government Boy's High School in Pattukkottai. When monsoon floods transformed rivers into raging torrents, SG would literally swim across to reach his classroom - a metaphor for his lifelong ability to navigate seemingly impossible challenges.\n\nThe halls of Rajah Serfoji Government Arts College in Thanjavur became his intellectual awakening, where chemistry captured his imagination and oratory skills flourished. Here, the quiet village boy discovered his voice, developing the communication prowess that would later make him a magnetic leader.\n\nHis first professional chapter unfolded at Karambayam Primary School, but Chennai's academic magnetism soon called to him. At Stanley Medical College's Biochemistry Department, working as a Demonstrator, destiny intervened through an encounter with Prof. Ne.Thu. Sundaravadivelu, the University of Madras Vice Chancellor.\n\nThis pivotal meeting opened doors to the Guindy campus in 1972, where SG's Master's degree in Biochemistry marked the beginning of his research legacy. Transitioning seamlessly from student to Lecturer, his intellectual appetite remained unsatisfied until he found his doctoral mentor in the legendary Prof. E.R.B. Shanmugasundaram.\n\nThe Ph.D. degree awarded in 1978 was not merely an academic achievement - it was the culmination of a rural boy's transformation into a scientific pioneer.",
  "aboutDescription3": "The University of Madras Biochemistry Department became SG's kingdom, where he orchestrated a symphony of scientific discovery spanning decades.\n\nRising through academic ranks like a master craftsman perfecting his art, he claimed the Professor's chair in 1989 before ascending to Departmental leadership in 1993. His research empire focused on humanity's most formidable adversaries - diabetes and cancer - yielding an impressive arsenal of seventy-two peer-reviewed publications that would influence global scientific discourse.\n\nAs an academic patriarch, SG nurtured twenty-two doctoral protégés and countless M.Phil. scholars, each carrying forward his innovative research methodologies. Beyond laboratory walls, his influence permeated university governance through Senate membership and election to the powerful Syndicate - the institution's inner circle of decision-makers.\n\nHis chairmanship of the Affiliation Committee and leadership as General Secretary of the Teachers Association demonstrated his commitment to academic democracy and faculty welfare.\n\nWhen voluntary retirement beckoned, SG's heart turned homeward to Vendakkottai, where he channeled his leadership into village transformation initiatives until fate intervened on October 24, 2009.\n\nHis life partner, Mrs. Manimegalai, stood as his unwavering pillar of strength, while their three children - two daughters and a son - witnessed their father's extraordinary journey.\n\nAs the first doctorate holder in his village, SG carried a profound sense of responsibility toward his community. He dedicated himself to helping those without formal education find pathways to learning and better opportunities in life. His special affinity for rural students reflected his own origins, creating educational bridges for countless village scholars to reach academic heights. SG understood that education was the great equalizer, and he worked tirelessly to ensure that lack of formal schooling would not become a permanent barrier for those seeking to improve their circumstances.\n\nHis philosophical cornerstone - that missing a million by one surpasses hitting a hundred perfectly - embodied his approach to ambitious goals and high aspirations.",
  "timelineTitle": "Academic Timeline",
  "timelineDescription": "Journey through the key milestones of Professor S. Govindasamy's remarkable academic career",
  "studentsTitle": "Student Directory",
  "studentsDescription": "Meet the 50+ PhD alumni who have achieved success under Professor S. Govindasamy's guidance",
  "galleryTitle": "Photo Gallery",
  "galleryDescription": "Visual journey through decades of academic excellence and student achievements",
  "achievementsTitle": "Achievements & Publications",
  "achievementsDescription": "Recognition, awards, and scholarly contributions throughout the academic career",
  "accountabilityTitle": "Financial Accountability",
  "accountabilityDescription": "Transparent reporting of funding sources and expenditure details",
  "contactTitle": "Contact & Legacy",
  "contactDescription": "Get in touch and learn about the continuing impact of Professor S. Govindasamy's work",
  "memorialTitle": "Memorial Statue Opening Ceremony",
  "memorialSubtitle": "Celebrating Professor S. Govindasamy's 80th Birthday",
  "memorialDescription": "Join us for the unveiling of the commemorative statue celebrating Professor S. Govindasamy's extraordinary life and his dedication to educating and uplifting people from all walks of life. A legacy that continues to inspire communities worldwide.",
  "ceremonyDate": "September 6th, 2025",
  "ceremonyLocation": "Vendakottai Village\nPattukottai Taluk\nThanjavur District",
  "ceremonyPurpose": "Celebrate His 80th Birthday",
  "exploreJourneyTitle": "Explore His Journey",
  "exploreJourneyDescription": "Discover the remarkable life of a man who dedicated himself to educating and uplifting communities through knowledge and compassion.",
  "aboutHisLife": "About His Life",
  "communityImpact": "Community Impact",
  "achievements": "Achievements",
  "lifeTimeline": "Life Timeline",
  "memorialMessage": "🕊️ In Loving Memory of Professor S. Govindasamy (1945-2009)",
  "memorialStatueDescription": "A commemorative statue was constructed in 2025 in his memory to celebrate his extraordinary contributions to academia and the success of his students worldwide. His legacy continues to inspire generations of scholars.",
  "clickForMaps": "📱 Click to view on Google Maps",
  "exploreHisLegacy": "Explore His Legacy",
  "dateLabel": "Date",
  "locationLabel": "Location",
  "purposeLabel": "Purpose"
}
