{
  "welcomeTitle": "Professor S. Govindasamy",
  "welcomeSubtitle": "Educational Philanthropist",
  "heroDescription": "Celebrating the remarkable journey of an educator who dedicated his life to helping people from all walks of life through education, community service, and philanthropic endeavors.",
  "professorName": "Professor S. Govindasamy",
  "professorTitle": "Professor Emeritus",
  "phdStudents": "PhD Students",
  "phdStudentsDesc": "Mentored and guided to success",
  "usaSuccess": "USA Success",
  "usaSuccessDesc": "Students now successful in USA",
  "yearsTeaching": "Years Teaching",
  "yearsTeachingDesc": "Dedicated to academic excellence",
  "awards": "Awards",
  "awardsDesc": "Recognition for outstanding contribution",
  "impactNumbers": "Impact in Numbers",
  "impactDescription": "A lifetime of dedication to academic excellence and student success",
  "exploreJourney": "Explore the Journey",
  "exploreDescription": "Discover the inspiring story of academic excellence and student transformation",
  "aboutTitle": "About Professor S. Govindasamy",
  "aboutDescription1": "Professor S. Govindasamy's journey from a small village to becoming a distinguished academic mentor is truly inspiring. His dedication to education and student development has transformed the lives of over 50 PhD students.",
  "aboutDescription2": "With over four decades of teaching experience, Professor Govindasamy has been instrumental in shaping the careers of numerous students, many of whom have achieved remarkable success in the United States and around the world.",
  "aboutDescription3": "His commitment to academic excellence, combined with his nurturing approach to mentorship, has made him a beloved figure in the academic community and a source of inspiration for generations of students.",
  "timelineTitle": "Academic Timeline",
  "timelineDescription": "Journey through the key milestones of Professor S. Govindasamy's remarkable academic career",
  "studentsTitle": "Student Directory",
  "studentsDescription": "Meet the 50+ PhD alumni who have achieved success under Professor S. Govindasamy's guidance",
  "galleryTitle": "Photo Gallery",
  "galleryDescription": "Visual journey through decades of academic excellence and student achievements",
  "achievementsTitle": "Achievements & Publications",
  "achievementsDescription": "Recognition, awards, and scholarly contributions throughout the academic career",
  "accountabilityTitle": "Financial Accountability",
  "accountabilityDescription": "Transparent reporting of funding sources and expenditure details",
  "contactTitle": "Contact & Legacy",
  "contactDescription": "Get in touch and learn about the continuing impact of Professor S. Govindasamy's work",
  "memorialTitle": "Memorial Statue Opening Ceremony",
  "memorialSubtitle": "Celebrating Professor S. Govindasamy's 80th Birthday",
  "memorialDescription": "Join us for the unveiling of the commemorative statue celebrating Professor S. Govindasamy's extraordinary life and his dedication to educating and uplifting people from all walks of life. A legacy that continues to inspire communities worldwide.",
  "ceremonyDate": "September 6th, 2025",
  "ceremonyLocation": "Vendakottai Village\nPattukottai Taluk\nThanjavur District",
  "ceremonyPurpose": "Celebrate His 80th Birthday",
  "exploreJourneyTitle": "Explore His Journey",
  "exploreJourneyDescription": "Discover the remarkable life of a man who dedicated himself to educating and uplifting communities through knowledge and compassion.",
  "aboutHisLife": "About His Life",
  "communityImpact": "Community Impact",
  "achievements": "Achievements",
  "lifeTimeline": "Life Timeline",
  "memorialMessage": "🕊️ In Loving Memory of Professor S. Govindasamy (1945-2009)",
  "memorialStatueDescription": "A commemorative statue was constructed in 2025 in his memory to celebrate his extraordinary contributions to academia and the success of his students worldwide. His legacy continues to inspire generations of scholars.",
  "clickForMaps": "📱 Click to view on Google Maps",
  "exploreHisLegacy": "Explore His Legacy",
  "dateLabel": "Date",
  "locationLabel": "Location",
  "purposeLabel": "Purpose"
}
