{
  "welcomeTitle": "பேராசிரியர் எஸ். கோவிந்தசாமி",
  "welcomeSubtitle": "சிறப்பு கல்வி மரபு",
  "heroDescription": "50+ முனைவர் மாணவர்களை வழிநடத்திய ஒரு பேராசிரியரின் குறிப்பிடத்தக்க பயணத்தை கொண்டாடுகிறோம், கிராமத்திலிருந்து உலகளாவிய வெற்றிக்கு வாழ்க்கையை மாற்றியுள்ளார்.",
  "professorName": "பேராசிரியர் எஸ். கோவிந்தசாமி",
  "professorTitle": "பேராசிரியர் எமரிட்டஸ்",
  "phdStudents": "முனைவர் மாணவர்கள்",
  "phdStudentsDesc": "வழிகாட்டப்பட்டு வெற்றிக்கு அழைத்துச் செல்லப்பட்டனர்",
  "usaSuccess": "அமெரிக்க வெற்றி",
  "usaSuccessDesc": "மாணவர்கள் இப்போது அமெரிக்காவில் வெற்றிகரமாக உள்ளனர்",
  "yearsTeaching": "ஆண்டுகள் கற்பித்தல்",
  "yearsTeachingDesc": "கல்வி சிறப்புக்கு அர்ப்பணிப்பு",
  "awards": "விருதுகள்",
  "awardsDesc": "சிறந்த பங்களிப்புக்கான அங்கீகாரம்",
  "impactNumbers": "எண்களில் தாக்கம்",
  "impactDescription": "கல்வி சிறப்பு மற்றும் மாணவர் வெற்றிக்கான வாழ்நாள் அர்ப்பணிப்பு",
  "exploreJourney": "பயணத்தை ஆராயுங்கள்",
  "exploreDescription": "கல்வி சிறப்பு மற்றும் மாணவர் மாற்றத்தின் ஊக்கமளிக்கும் கதையைக் கண்டறியுங்கள்",
  "aboutTitle": "பேராசிரியர் எஸ். கோவிந்தசாமி பற்றி",
  "aboutDescription1": "பேராசிரியர் எஸ். கோவிந்தசாமியின் ஒரு சிறிய கிராமத்திலிருந்து ஒரு சிறப்பு கல்வி வழிகாட்டியாக மாறிய பயணம் உண்மையிலேயே ஊக்கமளிக்கிறது. கல்வி மற்றும் மாணவர் மேம்பாட்டுக்கான அவரது அர்ப்பணிப்பு 50க்கும் மேற்பட்ட முனைவர் மாணவர்களின் வாழ்க்கையை மாற்றியுள்ளது.",
  "aboutDescription2": "நான்கு தசாப்தங்களுக்கும் மேலான கற்பித்தல் அனுபவத்துடன், பேராசிரியர் கோவிந்தசாமி பல மாணவர்களின் வாழ்க்கையை வடிவமைப்பதில் முக்கிய பங்கு வகித்துள்ளார், அவர்களில் பலர் அமெரிக்கா மற்றும் உலகம் முழுவதும் குறிப்பிடத்தக்க வெற்றியை அடைந்துள்ளனர்.",
  "aboutDescription3": "கல்வி சிறப்புக்கான அவரது அர்ப்பணிப்பு, வழிகாட்டுதலுக்கான அவரது பராமரிப்பு அணுகுமுறையுடன் இணைந்து, அவரை கல்வி சமூகத்தில் ஒரு பிரியமான நபராகவும், மாணவர்களின் தலைமுறைகளுக்கு ஊக்கத்தின் ஆதாரமாகவும் ஆக்கியுள்ளது.",
  "timelineTitle": "கல்வி காலவரிசை",
  "timelineDescription": "பேராசிரியர் எஸ். கோவிந்தசாமியின் குறிப்பிடத்தக்க கல்வி வாழ்க்கையின் முக்கிய மைல்கற்கள் வழியாக பயணம்",
  "studentsTitle": "மாணவர் அடைவு",
  "studentsDescription": "பேராசிரியர் எஸ். கோவிந்தசாமியின் வழிகாட்டுதலின் கீழ் வெற்றி பெற்ற 50+ முனைவர் முன்னாள் மாணவர்களை சந்திக்கவும்",
  "galleryTitle": "படக்காட்சி",
  "galleryDescription": "பல தசாப்தங்களின் கல்வி சிறப்பு மற்றும் மாணவர் சாதனைகள் வழியாக காட்சி பயணம்",
  "achievementsTitle": "சாதனைகள் & வெளியீடுகள்",
  "achievementsDescription": "கல்வி வாழ்க்கை முழுவதும் அங்கீகாரம், விருதுகள் மற்றும் அறிவார்ந்த பங்களிப்புகள்",
  "accountabilityTitle": "நிதி பொறுப்புணர்வு",
  "accountabilityDescription": "நிதி ஆதாரங்கள் மற்றும் செலவு விவரங்களின் வெளிப்படையான அறிக்கை",
  "contactTitle": "தொடர்பு & மரபு",
  "contactDescription": "தொடர்பு கொள்ளுங்கள் மற்றும் பேராசிரியர் எஸ். கோவிந்தசாமியின் பணியின் தொடர்ச்சியான தாக்கத்தைப் பற்றி அறியுங்கள்"
}
